In [1]:
import pandas as pd

In [2]:
dados = {
            'emprego': ['dba', 'programador','arquiteto_redes'],
            'nova_jersey': [97350, 82000, 112840],
            'florida': [ 77140, 71540, 62310]
        }

In [3]:
type(dados)

dict

In [4]:
dataset = pd.DataFrame(dados)

In [5]:
dataset.head()

           emprego  nova_jersey  florida
0              dba        97350    77140
1      programador        82000    71540
2  arquiteto_redes       112840    62310

In [6]:
dataset['nova_jersey'].sum()

292190

In [7]:
dataset['florida'].sum()

210990

In [8]:
dataset['%_nova_jersey'] = dataset['nova_jersey'] / dataset['nova_jersey'].sum()

In [9]:
dataset['%_florida'] = dataset['florida'] / dataset['florida'].sum()

In [10]:
dataset

           emprego  nova_jersey  florida  %_nova_jersey  %_florida
0              dba        97350    77140       0.333174   0.365610
1      programador        82000    71540       0.280639   0.339068
2  arquiteto_redes       112840    62310       0.386187   0.295322

In [12]:
dataset2 = pd.read_csv('../0_datasets/census.csv')

In [15]:
dataset2.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [20]:
dataset2 = dataset2[['income', 'education']]
dataset2

       income    education
0       <=50K    Bachelors
1       <=50K    Bachelors
2       <=50K      HS-grad
3       <=50K         11th
4       <=50K    Bachelors
...       ...          ...
32556   <=50K   Assoc-acdm
32557    >50K      HS-grad
32558   <=50K      HS-grad
32559   <=50K      HS-grad
32560    >50K      HS-grad

[32561 rows x 2 columns]

In [23]:
dataset3 = dataset2.groupby(['education', 'income'])['education'].count()
dataset3

education      income
 10th           <=50K     871
                >50K       62
 11th           <=50K    1115
                >50K       60
 12th           <=50K     400
                >50K       33
 1st-4th        <=50K     162
                >50K        6
 5th-6th        <=50K     317
                >50K       16
 7th-8th        <=50K     606
                >50K       40
 9th            <=50K     487
                >50K       27
 Assoc-acdm     <=50K     802
                >50K      265
 Assoc-voc      <=50K    1021
                >50K      361
 Bachelors      <=50K    3134
                >50K     2221
 Doctorate      <=50K     107
                >50K      306
 HS-grad        <=50K    8826
                >50K     1675
 Masters        <=50K     764
                >50K      959
 Preschool      <=50K      51
 Prof-school    <=50K     153
                >50K      423
 Some-college   <=50K    5904
                >50K     1387
Name: education, dtype: int64

In [24]:
dataset3.index

MultiIndex([(        ' 10th', ' <=50K'),
            (        ' 10th',  ' >50K'),
            (        ' 11th', ' <=50K'),
            (        ' 11th',  ' >50K'),
            (        ' 12th', ' <=50K'),
            (        ' 12th',  ' >50K'),
            (     ' 1st-4th', ' <=50K'),
            (     ' 1st-4th',  ' >50K'),
            (     ' 5th-6th', ' <=50K'),
            (     ' 5th-6th',  ' >50K'),
            (     ' 7th-8th', ' <=50K'),
            (     ' 7th-8th',  ' >50K'),
            (         ' 9th', ' <=50K'),
            (         ' 9th',  ' >50K'),
            (  ' Assoc-acdm', ' <=50K'),
            (  ' Assoc-acdm',  ' >50K'),
            (   ' Assoc-voc', ' <=50K'),
            (   ' Assoc-voc',  ' >50K'),
            (   ' Bachelors', ' <=50K'),
            (   ' Bachelors',  ' >50K'),
            (   ' Doctorate', ' <=50K'),
            (   ' Doctorate',  ' >50K'),
            (     ' HS-grad', ' <=50K'),
            (     ' HS-grad',  ' >50K'),
            (     ' Masters', ' <=50K'),
            (     ' Masters',  ' >50K'),
            (   ' Preschool', ' <=50K'),
            ( ' Prof-school', ' <=50K'),
            ( ' Prof-school',  ' >50K'),
            (' Some-college', ' <=50K'),
            (' Some-college',  ' >50K')],
           names=['education', 'income'])

In [28]:
dataset3[' Bachelors', ' <=50K'], dataset3[' Bachelors', ' >50K']

(3134, 2221)

In [29]:
3134 + 2221

5355

In [30]:
3134/5355 * 100

58.52474323062559

In [32]:
2221/5335 * 100

41.63074039362699